{
  "version": "2.4.1",
  "summary": {
    "title": "Bank Threat Model",
    "owner": "Mohamed elsayed Fawzy",
    "description": "System Overview\nThe banking system consists of  infrastructure and digital assets that facilitate financial transactions, customer data storage, and secure communication between banking entities. The system includes online banking services, ATMs, internal employee platforms, and customer account management.\n\n2. Core Components\n\n  Customer Data\n\n   Stores personal and financial information of customers.\n   Used for identity verification, transactions, and account management.\n\n Threats:\n     Data Breach: Unauthorized access to sensitive data.\n    Phishing Attack: Attackers trick users into providing credentials.\n \n Banking Infrastructure\n\n   Core system responsible for processing transactions, fund transfers, and account management.\n  Connected to various banking applications, ATMs, and third-party services.\n    Threats:\n    Ransomware Attack: Malware encrypts banking data and demands ransom.\n     Insider Threat: Malicious or compromised employees leak sensitive data.\n\nAutomated Teller Machines (ATMs) deployed in various locations.\nHandles cash withdrawals, deposits, and card transactions.\nThreats:\nPhysical Tampering: Skimmers installed to steal customer card data.\nDDoS Attack: Attackers disrupt network communication to ATMs.\nInternal Employee Systems\n\n4. Security Considerations\nData Encryption: Encrypt sensitive customer data in transit and at rest.\nMulti-Factor Authentication (MFA): Prevent unauthorized access to accounts.\nDDoS Mitigation: Implement rate limiting and firewalls.\nInsider Threat Detection: Monitor employee activity for suspicious behavior.\n",
    "id": 0
  },
  "detail": {
    "contributors": [],
    "diagrams": [
      {
        "id": 0,
        "title": "New STRIDE diagram",
        "diagramType": "STRIDE",
        "placeholder": "New STRIDE diagram description",
        "thumbnail": "./public/content/images/thumbnail.stride.jpg",
        "version": "2.4.1",
        "cells": []
      }
    ],
    "diagramTop": 2,
    "reviewer": "Akmal Ibrahim",
    "threatTop": 0
  }
}